module.exports = {
	name: 'master', // اسم الامر
	description: "this command has been created for the vip person '_1Master' to نيك om emad", // شرح الامر
	cooldown: 1, // الكول داون بـ الثواني
	execute: async function(db, client ,message , args) {
client.createMessage(message.channel.id,`
اليوم درس ازاي انيك , بشرح الاستاذ ماستر!
رح نجرب الطريقة على ام عماد 
===========================================
- افتح زبك
- خليه تلحسه شوي
- افتح صدوره
- مص صدروه شوي
- افتح كسها
- نيكه براحه في بدايه
- وكل شوي ابدا زيد السرعه
===========================================
- لازم ام عماد تتمحن كثير
- مص كسها
- جيب زبك
- حطه فثمها 
- هنا ام عماد هيصير وجها احمرررر
- هنا انت جبت طفل مبروك عليك!!
`)
}}